exports.festivalData = {
    "solarDate": {
        "01/01": "元旦", // Jan.
        "02/14": "情人节", // Feb
        "03/05": "雷锋日", "03/08": "妇女节", "03/12": "植树节", "03/15": "消权日", // Mar.
        "04/01": "愚人节",  // Apl.
        "05/01": "劳动节", "05/04": "青年节", "05/12": "护士节", // May
        "06/01": "儿童节", // June
        "07/01": "建党节", // July
        "08/01": "建军节", // Augst.
        "09/03": "抗日战争胜利纪念日", "09/10": "教师节", // Sept.
        "10/01": "国庆节", "10/31": "万圣节", // Oct.
        "11/08": "记者节", "11/11":"光棍节", // Nov.
        "12/13": "南京大屠杀死难者公祭日", "12/24": "平安夜", "12/25": "圣诞节" // Dec.
    },
    "lunarDate": {
        "正月初一": "春节", "正月初五": "破五节", "正月初七": "七草节", "正月十五": "元宵", 
        "二月初二": ["龙抬头", "社日节"], "二月十三": "花朝节",
        "三月初三": "上巳节",
        "五月初五": "端午", 
        "七月初七": "七夕", "七月十四": "中元节",
        "八月十五": "中秋",
        "九月初九": "重阳",
        "十月初一": "寒衣节", "十月十五": "下元节",
        "腊月初八": "腊八", "腊月廿四": "小年"
    },
    "special": {
        "ld": {
            "农历最后一天": "除夕", "清明前1天": "寒食节",
        },
        "sd": {
            "6第3个Sun.": "父亲节",
            "5第2个Sun.": "母亲节",
            "5第3个Sun.": "全国助残日",
            "9第3个Sat.": "全民国防纪念日",
            "9第4个Sun.": "国际聋人节",
            "11第4个Thur.": "感恩节",
            "3最后1个Mon.": "全国中小学生安全教育日", 
        }
    },
    "normal": {
        "02/15": "中国12亿人口日", 
        "03/05": "中国青年志愿者服务日", "03/16": "手拉手情系贫困小伙伴全国统一行动日", "03/18": "全国科技人才活动日", "03/24": "保钓登岛日", 
        "04/15": "全民国家安全教育日", "04/23": "中国海军建军节", "04/24": "中国航天日", 
        "05/12": "防灾减灾日", "05/17": "电信日", "05/19": "中国旅游日", 
        "06/05": "世界环境日", "06/06": "全国爱眼日 1966", "06/11": "中国人口日", "06/25": "全国土地日", 
        "07/01": "香港回归", "07/11": "中国航海节", 
        "08/08": "爸爸节", 
        "09/18": "九·一八事变", "09/20": ["全国爱牙日", "公民道德宣传日"], "09/30": "烈士纪念日", 
        "10/01": ["国际音乐日", "国际老人节"], "10/09": "邮政日", "10/10": "辛亥革命纪念", "10/16": "世界粮食日", "10/17": "扶贫日", 
        "11/09": "中国消防日", "11/10": "世界青年节", 
        "12/01": "世界艾滋病日", "12/02": "全国交通安全日", "12/03": "世界残疾人口日", "12/04": "中国宪法日", "12/09": "一二·九运动", "12/12": "西安事变", "12/20": "澳门回归", 
    },
    getSolarTerm (yyyy, mm, dd){
        mm = mm-1;
        var sTermInfo = [ // 
            0, 21208, 42467, 63836, 
            85337, 107014, 128867, 150921, 
            173149, 195551, 218072, 240693, 
            263343, 285989, 308563, 331033, 
            353350, 375494, 397447, 419210, 
            440795, 462224, 483532, 504758
        ];
        var solarTerm = [
            "小寒", "大寒", "立春", "雨水", 
            "惊蛰", "春分", "清明", "谷雨", 
            "立夏", "小满", "芒种", "夏至", 
            "小暑", "大暑", "立秋", "处暑", 
            "白露", "秋分", "寒露", "霜降", 
            "立冬", "小雪", "大雪", "冬至"
        ];
        var tmp1 = new Date(
            (31556925974.7 * (yyyy-1900) + sTermInfo[mm*2+1]*60000) + 
            Date.UTC(1900,0,6,2,5)
        );
        // console.log(tmp1)
        var tmp2 = tmp1.getUTCDate();
        var solarTerms = "";
        if (tmp2 === dd) solarTerms = solarTerm[mm*2+1];
        tmp1 = new Date(
            (31556925974.7*(yyyy-1900) + sTermInfo[mm*2]*60000) + 
            Date.UTC(1900,0,6,2,5)
        );
        tmp2 = tmp1.getUTCDate();
        if (tmp2 === dd) solarTerms = solarTerm[mm*2];
        return solarTerms;
    }
}